package rtss.pre1917.data;

import java.util.ArrayList;
import java.util.Collections;
import java.util.HashMap;
import java.util.HashSet;
import java.util.List;
import java.util.Map;
import java.util.Set;

import rtss.util.Util;

/**
 * Губернии, области и территории России
 */
public class TerritoryNames
{
    public static Set<String> seen = new HashSet<>();
    public static Map<String, String> aliases = new HashMap<>();

    static
    {
        defineAliases();
    }

    public static String canonic(String ter) throws Exception
    {
        ter = Util.despace(ter).trim();
        if (ter.equals(""))
            return "";

        ter = ter.replace("і", "и");
        ter = ter.replace("i", "и");
        ter = ter.replace("ѣ", "е");
        ter = ter.replace("ъ ", " ");
        ter = ter.replace("ъ-", "-");
        if (ter.endsWith("ъ"))
            ter = Util.stripTail(ter, "ъ");
        ter = ter.replace(" вь ", " в ");
        ter = ter.replace("Итога ", "Итого ");
        ter = ter.replace("Итого в ", "");
        ter = ter.replace("Итого ва ", "");
        ter = ter.replace("Итого на ", "");
        ter = ter.replace("Всего в ", "");
        ter = ter.replace("Среднее для ", "");
        ter = ter.replace("Среднее дли ", "");

        ter = ter.replace("С-Петербург", "Санкт-Петербург");
        ter = ter.replace("С-Петербург", "Санкт-Петербург");
        ter = ter.replace("Петроград", "Санкт-Петербург");
        ter = ter.replace("Петроградская", "Санкт-Петербургская");
        ter = ter.replace("Петроградская", "Санкт-Петербургская");
        ter = ter.replace("С.-Петербургcкая", "Санкт-Петербургская");
        ter = ter.replace("С.-Петербургская", "Санкт-Петербургская");

        if (ter.startsWith("В "))
            ter = Util.stripStart(ter, "В ");
        if (ter.startsWith("Во "))
            ter = Util.stripStart(ter, "Во ");
        if (ter.startsWith("На "))
            ter = Util.stripStart(ter, "На ");

        if (ter.startsWith("Г "))
            ter = "г. " + Util.stripStart(ter, "Г ");
        if (ter.startsWith("Г. "))
            ter = "г. " + Util.stripStart(ter, "Г. ");
        if (ter.startsWith("г "))
            ter = "г. " + Util.stripStart(ter, "г ");

        if (ter.endsWith(" г"))
            ter = Util.stripTail(ter, " г") + " губ.";
        if (ter.endsWith(" г."))
            ter = Util.stripTail(ter, " г.") + " губ.";
        if (ter.endsWith(" губ"))
            ter = Util.stripTail(ter, " губ") + " губ.";
        if (ter.endsWith(" -"))
            ter = Util.stripTail(ter, " -");

        if (ter.endsWith(" обл"))
            ter = Util.stripTail(ter, " обл") + " обл.";

        if (aliases.containsKey(ter))
            ter = aliases.get(ter);

        if (ter.endsWith(" губ."))
            ter = Util.stripTail(ter, " губ.");
        if (ter.endsWith(" губ"))
            ter = Util.stripTail(ter, " губ");

        seen.add(ter);
        
        if (!getValidTerritoryNames().contains(ter))
            throw new Exception("Invalid territory name [" + ter + "]");

        return ter;
    }

    public static List<String> getSeen()
    {
        List<String> list = new ArrayList<>(seen);
        Collections.sort(list);
        return list;
    }

    public static void printSeen()
    {
        for (String s : getSeen())
            Util.out(s);
    }

    public static void aliases(String name, String... xaliases)
    {
        for (String x : xaliases)
            aliases.put(x, name);
    }

    private static void defineAliases()
    {
        aliases("Акмолинская обл.", "Акмолинская");
        aliases("Амурская обл.", "Амурская");
        aliases("неземские губернии", "неземск губ.", "неземских губ.",
                "неземских губерний", "неземских губериий", "неземских губерниях",
                "12 прежних неземских губерний", "12 прежних неземских губ.",
                "В 12 прежних неземских губ.", "В 12 прежних меземских губ.");
        aliases("34 старо-земских губерний", "34 старо-земских губ.", "т ч в 34 старо-земских губ.");
        aliases("г. Варшава", "Варшава", "г. Варшава.");
        aliases("Азиатская Россия", "азиатская Россия", "Азиатской России");
        aliases("Империя", "Империи", "всей Империи");
        aliases("Дагестанская обл.", "Дагестанская");
        aliases("Область войска Донского", "Донскаго в обл.", "Донскаго войска область", "Донская", 
                "Обл Войска Донского", "Области Войска Донского");
        aliases("Забайкальская обл.", "Забайкальская", "Забайкальсая");
        aliases("Закаспийская обл.", "Закаспийская");
        aliases("Елисаветпольская", "Елизаветпольская", "Елисаветнодьекая", "Елисаветпольскаа",
                "Елисаветпольсхая", "Елнсаветпольская", "Елисаветиольская");
        aliases("Средняя Азия", "Средней Азии", "Среднеазиатские области", "Ср.-Азиатских областей");
        aliases("Екатеринославская", "Екатеранославская");
        aliases("Европейская Россия", "европейская Россия", "Европейской России",
                "в Европейской России");
        aliases("г. Санкт-Петербург", "г. Петербург", "г. Петроград", "г. С.-Петербург", "С.-Петербург");
        aliases("привислинские губернии", "привислинские губ.", "привисленских губ.",
                "привислинск губ.", "привислинских губерний", "привислинcк губ.", "привислинских губ.",
                "привнслинск губ.", "привислинских губерниях");
        aliases("Гродненская", "гродненская");
        aliases("Эстляндская", "Эстляндсхая");
        aliases("Ферганская обл.", "Ферганская", "Фергранская");
        aliases("Уральская обл.", "Уральская", "У ральская");
        aliases("Тургайская обл.", "Тургайская", "Тургайсксая");
        aliases("Сыр-Дарьинская обл.", "Сьр-Дарьинская", "Сыр-Дарьинская", "Сыр-Даринская обл.",
                "Сыр-Даринсккая", "Сыр-Дарьинска я");
        aliases("Семиреченская обл.", "Семиреченская", "Семириченская", "Семриеченская", "Семвреченская", "Семнреченская");
        aliases("Семипалатинская обл.", "Семипалатинская");
        aliases("г. Севастополь", "Севастопольское", "Севастопольское градон");
        aliases("Самаркандская обл.", "Самарканская", "Самаркандская");
        aliases("Приморская обл.", "Приморская", "Приморекая");
        aliases("г. Николаев", "Николаевское град", "Николаевское градон");
        aliases("Смоленская", "Смоленсяая");
        aliases("Остзейские губернии", "остзейские губернии", "остзейских губ.", "остзейских губерний",
                "остзейских", "остзейских губ.", "Остзейские", "прибалтийские губернии", "прибалтийск губ.",
                "остзейских губерниях");
        aliases("земские губернии", "земск губ.", "земских губ.", "земских губерний", "земских губерниях");
        aliases("50 губерний Европейской России", "50 губерний Европейской России");
        aliases("Семиреченская обл.", "Сѳмиреченская", "Семиреченская");
        aliases("Сахалин", "Остр Сахалин", "Остров Сахалин", "Сахалинская",
                "Сев Сахалин", "Сев. Сахалин", "Остр. Сахалин");
        aliases("г. Варшава", "Варшава");
        aliases("Амурская обл.", "Амурская");
        aliases("Акмолинская обл.", "Акмолинская");
        aliases("45 губерний Европейской России", "45 губ Евр России");
        aliases("51 губерния Европейской России", "51 губернии Европейской России");
        aliases("50 губерний Европейской России", "50 губерниях Европейской России");
        aliases("Средне-волжский район", "средне-волжском районе", "средне-волжском раойне");
        aliases("Центральный земледельческий район", "центральн земледел районе", "центральном земледел районе");
        aliases("Юго-западный район", "юго-западный район", "юго-западном районе", "юго-западном район");
        aliases("Новороссийский район", "новороссийский район", "новороссийском районе", "новороссийком район");
        aliases("Московский промышленный район", "Московском промышленном", "Московском промышленном р");
        aliases("Область войска Донского", "Обл в Донского", "Обл войска Донск", "Обл войска Донскаго",
                "Обл войска Донского", "Обл. войска Донского");
        aliases("Сибирь", "Сибири");
        aliases("Терская обл.", "Терская");
        aliases("Уфимская", "Уфимскя");
        aliases("Якутская обл.", "Якутская", "Якуткая обл.");
        aliases("белорусский район", "белорусском районе");
        aliases("г. Москва", "г. Моcква", "Москва");
        aliases("литовский район", "литовском", "литовском р");
        aliases("малороссийский район", "малороссийском районе", "маоороссийском районе", "Малороссииском район");
        aliases("неземские губернии", "неземcких губ.", "неземcких", "неземских");
        aliases("Нижневолжский район", "нижневолжском районе", "нижне-волжском район");
        aliases("приуральский район", "приуральском районе", "приурадьек", "приуральском р.");
        aliases("приозерный район", "приозерн р", "приозерн");
        aliases("северный район", "северном р", "северном");
        aliases("Радомская", "Радомекая", "Радомккая", "Радонская", "Раломская");
        aliases("Терская обл.", "Терская");
        aliases("Амурская обл.", "Амурмская");
        aliases("Забайкальская", "Бабайкальская");
        aliases("Виленская", "Виленская.");
        aliases("Витебская", "Витебсиая", "Витебска я");
        aliases("Калишская", "Еалишск&я", "К-алишская", "Калипиская", "Калишcкая");
        aliases("Кавказ", "Кавказе", "Кавказа");
        aliases("Карсская обл.", "Карсская");
        aliases("Лифляндская", "ЛиФляндская", "Лифлфяндская", "Лифляанская", "Лифляндсксая",
                "Лифлянская", "Лифдяндская");
        aliases("Ломжинская", "Ломжинскаа", "Ломжинокая", "Ловшинская");
        aliases("Плоцкая", "Плоцвая");
        aliases("Петроковская", "Петрояовская");
        aliases("Тифлисская", "Тисяисская");
        aliases("г. Баку", "Бакинское градонач", "Бакинское градояан");
        aliases("Келецкая", "Кедецкая");
        aliases("Люблинская", "Люблянская");
        aliases("Седлецкая", "Седлцкая", "Седлевская", "Седледкая");
        aliases("Кубанская обл.", "Кубанская");
        aliases("Забайкальская обл.", "Забайкальская");
        aliases("Ковенская", "Ковенсиая");
        aliases("Ярославская", "Ярославская.");
        aliases("г. Одесса", "Одесса");
    }

    private static final Set<String> validTerritoryNames = new HashSet<>();

    public static Set<String> getValidTerritoryNames() throws Exception
    {
        if (validTerritoryNames.size() == 0)
        {
            for (String s : Util.loadResource("valid-territory-names.txt").replace("\r\n", "\n").split("\n"))
            {
                s = s.trim();
                if (s.length() != 0)
                    validTerritoryNames.add(s);
            }
        }

        return validTerritoryNames;
    }
}
